rails-backend/app/controllers/comments_controller.rb

  def index
    @comments = @article.comments.order(created_at: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? ORDER BY "comments"."created_at" DESC  [["article_id", 1]]

  def create
    unless signed_in?
      captcha_params = params.require(:comment).permit(:captcha_key, :captcha_answer)
      captcha_key = captcha_params[:captcha_key]
      captcha_answer = captcha_params[:captcha_answer]

      unless TextCaptcha.valid_answer?(captcha_key, captcha_answer)
        render json: { errors: { captcha: ['could not validate captcha'] } }, status: :forbidden and return
      end
    end

    @comment = @article.comments.new(comment_params)
    @comment.user = current_user if signed_in?

    render json: { errors: @comment.errors }, status: :unprocessable_entity unless @comment.save
---
INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "My comment"], ["user_id", 1], ["article_id", 1], ["created_at", "2018-11-28 20:10:56.039563"], ["updated_at", "2018-11-28 20:10:56.039563"]]

  def destroy
    @comment = @article.comments.find(params[:id])

    if @comment.user_id == @current_user_id
      @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

  def find_article!
    @article = Article.find_by!(slug: params[:article_slug])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "some-slug"], ["LIMIT", 1]]